du4/STM32H723_USB_HOST_HUB/Middlewares/ST/STM32_USB_Host_Library/Core/Src/usbh_core.c
            /* Inform user that a class has been activated */
            phost->pUser(phost, HOST_USER_CLASS_SELECTED);
          }else{
            phost->gState = HOST_ABORT_STATE;
            USBH_UsrLog("Device not supporting %s class.", phost->pActiveClass->Name);
          }
        }else{
          phost->gState = HOST_ABORT_STATE;
          USBH_UsrLog("No registered class with code %02X for this device.", (unsigned) phost->device.CfgDesc.Itf_Desc[0].bInterfaceClass);
        }
      }
      break;

    case HOST_CLASS_REQUEST:

	if(pCurrentHubHandle->initState == HUB_INIT_IN_PROGRESS && phost->pActiveClass->ClassCode != USB_HUB_CLASS){
// close current control pipes
			(void)USBH_FreePipe(phost, phost->Control.pipe_out);
			USBH_ClosePipe (phost, phost->Control.pipe_out);
			(void)USBH_FreePipe(phost, phost->Control.pipe_in);
			USBH_ClosePipe (phost, phost->Control.pipe_in);
// select root hub target
			phost->currentTarget = &pCurrentHubHandle->target;
			pCurrentHubHandle->ctl_state = HUB_REQ_RESETS;
			phost->Control.state = CTRL_SETUP;
			phost->EnumState = ENUM_IDLE;
			USBH_ProcessDelay(phost, HOST_DEV_ATTACHED, 5);
			break;
		}else if(pCurrentHubHandle->initState == USBH_HUB_PORTS_ARE_INITIALIZED){
			USBH_UsrLog("USB HUB#%d pots scan is DONE!", pCurrentHubHandle->target.dev_address);
			pCurrentHubHandle->initState = HUB_REQ_DONE;

			if(pCurrentHubHandle->parentHub != NULL){
				pCurrentHubHandle = pCurrentHubHandle->parentHub;
// close current control pipes
				(void)USBH_FreePipe(phost, phost->Control.pipe_out);
				USBH_ClosePipe (phost, phost->Control.pipe_out);
				(void)USBH_FreePipe(phost, phost->Control.pipe_in);
				USBH_ClosePipe (phost, phost->Control.pipe_in);
				phost->currentTarget = &pCurrentHubHandle->target;
				pCurrentHubHandle->ctl_state = HUB_REQ_RESETS;
				phost->Control.state = CTRL_SETUP;
				phost->EnumState = ENUM_IDLE;
				USBH_ProcessDelay(phost, HOST_DEV_ATTACHED, 5);
			}else{
				pCurrentHubHandle = 0;
				USBH_UsrLog("USB host enumeration is DONE!");
				phost->pUser(phost, HOST_USER_CLASS_ACTIVE);

//				phost->pActiveClass = phost->pClass[1];
//				phost->pActiveClass->pData = phost->rootHubHanlde->devices[0];

				phost->gState = HOST_CLASS;
			}
			break;
		}

      /* process class standard control requests state machine */
      if (phost->pActiveClass != NULL) {
        status = phost->pActiveClass->Requests(phost);
        if (status == USBH_OK){
          phost->gState = HOST_CLASS;
        }else if (status == USBH_HUB_REQ_REENUMERATE){
			phost->EnumState = ENUM_IDLE;
			pCurrentHubHandle->portNeedToEnumerate = 0; //if root device is HUB check port isConnected.
			USBH_ProcessDelay(phost, HUB_PORT_INIT, 5);
			status = USBH_OK;
            USBH_UsrLog("Device#%d %s class require re-enumeration.", phost->currentTarget->dev_address, phost->pActiveClass->Name);
        }else if (status == USBH_FAIL){
        	phost->gState = HOST_ABORT_STATE;
        	USBH_ErrLog("Device not responding Please Unplug.");
        }else{
          /* .. */
        }
      }else{
        phost->gState = HOST_ABORT_STATE;
        USBH_ErrLog("Invalid Class Driver.");
      }
      break;

    case HOST_CLASS:
      /* process class state machine */
      if (phost->pActiveClass != NULL){
        phost->pActiveClass->BgndProcess(phost);
      }
      break;

    case HOST_DEV_DISCONNECTED :

    	// MORI - Hub disconnecting, remove all plugged devices
//    	{
//    		int i;
//    		for(i = 1; i < ARRAY_SIZE(hUSBHost); ++i)
//    		{
//    			if(hUSBHost[i].valid)
//    			{
//    				if(hUSBHost[i].pActiveClass != NULL)
//    				{
//    					hUSBHost[i].pActiveClass->DeInit(&hUSBHost[i]);
//    					hUSBHost[i].pActiveClass = NULL;
//    				}
//
//    				memset(&hUSBHost[i], 0, sizeof(USBH_HandleTypeDef));
//    			}
//    		}
//    	}

      phost->device.is_disconnected = 0U;

      (void)DeInitStateMachine(phost);
      /* Re-Initilaize Host for new Enumeration */
      if (phost->pActiveClass != NULL){
        phost->pActiveClass->DeInit(phost);
        phost->pActiveClass = NULL;
      }

      if (phost->pUser != NULL){
        phost->pUser(phost, HOST_USER_DISCONNECTION);
      }
      USBH_UsrLog("USB Device disconnected");

      if (phost->device.is_ReEnumerated == 1U){
        phost->device.is_ReEnumerated = 0U;

        /* Start the host and re-enable Vbus */
        (void)USBH_Start(phost);
      }else{
        /* Device Disconnection Completed, start USB Driver */
        (void)USBH_LL_Start(phost);
      }
      break;

	case HOST_DELAY:
		if  ((HAL_GetTick() - phost->tickstart) >= phost->wait)
			phost->gState = phost->gPushState;
		break;

    case HOST_ABORT_STATE:
    default :
      break;
  }
  return USBH_OK;
}


/**
  * @brief  USBH_HandleEnum
  *         This function includes the complete enumeration process
  * @param  phost: Host Handle
  * @retval USBH_Status
  */
static USBH_StatusTypeDef USBH_HandleEnum(USBH_HandleTypeDef *phost){
  USBH_StatusTypeDef Status = USBH_BUSY;
  USBH_StatusTypeDef ReqStatus = USBH_BUSY;

  switch (phost->EnumState){
    case ENUM_IDLE:
      /* Get Device Desc for only 1st 8 bytes : To get EP0 MaxPacketSize */
      ReqStatus = USBH_Get_DevDesc(phost, 8U);
      if (ReqStatus == USBH_OK){
        phost->Control.pipe_size = phost->device.DevDesc.bMaxPacketSize;
        phost->EnumState = ENUM_GET_FULL_DEV_DESC;

        /* modify control channels configuration for MaxPacket size */
        (void)USBH_OpenPipe(phost, phost->Control.pipe_in, 0x80U, phost->currentTarget, USBH_EP_CONTROL,(uint16_t)phost->Control.pipe_size);
        /* Open Control pipes */
        (void)USBH_OpenPipe(phost, phost->Control.pipe_out, 0x00U, phost->currentTarget, USBH_EP_CONTROL, (uint16_t)phost->Control.pipe_size);
      }else if (ReqStatus == USBH_NOT_SUPPORTED){
        USBH_ErrLog("Control error: Get Device Descriptor request failed");
        phost->device.EnumCnt++;
        if (phost->device.EnumCnt > 3U){
          /* Buggy Device can't complete get device desc request */
          USBH_UsrLog("Control error, Device not Responding Please unplug the Device.");
          phost->gState = HOST_ABORT_STATE;
        }else{
          /* free control pipes */
          (void)USBH_FreePipe(phost, phost->Control.pipe_out);
          (void)USBH_FreePipe(phost, phost->Control.pipe_in);

          /* Reset the USB Device */
          phost->gState = HOST_IDLE;
        }
      }else{
        /* .. */
      }
      break;

